backend/stress-test.yml
config:
  target: "https://messageapp-dj2x.onrender.com"
  engines:
    socketio:
      transports: ["websocket"] # Direkt websocket për performancë maksimale
  phases:
    - duration: 120
      arrivalRate: 1 # Brenda 120 sekondave krijon 120 përdorues (120 * 1 = 120)

scenarios:
  - name: "Live Persistent Users"
    engine: socketio
    flow:
      - emit:
          channel: "joinUser"
          data: "123"
      # Ky loop i mban përdoruesit brenda për 100 sekonda duke dërguar mesazhe çdo 5 sekonda
      - loop:
          - emit:
              channel: "sendMessage"
              data:
                content: "Testing real-time load..."
                senderId: "123"
                receiverId: "456"
          - think: 5
        count: 20 # 20 përsëritje x 5 sekonda = 100 sekonda qëndrim online